Repository: danjac/audiotrails
Catalog: radiofeed/i18n/*/LC_MESSAGES/django.po
Languages: fi

source: {total_hours}h
fi: {total_hours}t

source: Release Date
fi: Päivämäärä

source: Episode Website Page
fi: Jakson Kotisivu

source: Season Episode Number
fi: Kauden Jaksonumero

source: Season
fi: Kausi

source: Cover Image
fi: Kansikuva

source: Episode {episode}
fi: Jakso {episode}

source: Season {season}
fi: Kausi {season}

source: User
fi: Käyttäjä

source: Timestamp Mark (Seconds)
fi: Aikamerkki

source: Removed from History
fi: Poistettu Historiasta

source: Added to Bookmarks
fi: Lisätty Kirjanmerkkeihin

source: Removed from Bookmarks
fi: Poistettu Kirjanmerkkeistä

source: Active
fi: Aktiivinen

source: Inactive
fi: Ei Aktiivinen

source: Feed Update Result
fi: Jäsennystulos

source: None
fi: Ei mitään

source: Promoted
fi: Ylennetyt

source: Subscribed
fi: Tilaattu

source: Hi {username}, here are some new podcasts you might like!
fi: Hei {username}, tässä on uusia podcasteja, joista saatat pitää!

source: Parent Category
fi: Ylikategoria

source: Success
fi: Menestys

source: Complete
fi: Valmis

source: Not Modified
fi: Ei muokkaattu

source: HTTP Error
fi: HTTP-Virhe

source: RSS Parser Error
fi: RSS-Jäsennysvirhe

source: Duplicate Feed
fi: Kaksoispodcast

source: RSS Feed
fi: RSS-Syöte

source: Podcast Description
fi: Podcastin Kuvaus

source: Website
fi: Kotisivu

source: Sorry, an error occurred trying to access iTunes.
fi: Yhteys iTunesiin ei menestynyt

source: You are now subscribed to this podcast
fi: Olet tilaanut podcastin

source: You are no longer subscribed to this podcast
fi: Olet lopettanut tilauksen podcastiin

source: Reload Page
fi: Lataa uudestaan

source: Sorry, this page does not exist, or it has been removed.
fi: Valitettavasti tätä sivua ei ole olemassa tai se on poistettu.

source: Sorry, you cannot perform this action. You may have disabled JavaScript on your browser or are using an older browser that does not support this action.
fi: Valitettavasti et voi suorittaa tätä toimintoa. Olet ehkä poistanut JavaScriptin käytöstä selaimessasi tai käytät vanhempaa selainta, joka ei tue tätä toimintoa.

source: Sorry, an unexpected error has occurred. The server admins have already been notified.
fi: Valitettavasti tapahtui odottamaton virhe. Palvelimen ylläpitäjille on jo ilmoitettuValitettavasti tapahtui odottamaton virhe. Palvelimen ylläpitäjille on jo ilmoitettu.

source: About
fi: Tiedot

source: About Us
fi: Tiedot Meistä

source: <strong>%(site_name)s</strong> is a <strong>free</strong> podcasting app for collecting your favorite shows and discovering new content.
fi: <strong>%(site_name)s</strong> on <strong>ilmainen</strong> on ilmainen podcast-sovellus suosikkiohjelmiesi keräämiseen ja uuden sisällön löytämiseen.

source: Technology
fi: Teknikka

source: Additional Credits
fi: Lisää kunnioita

source: General Disclaimer
fi: Yleinen Vastuuvapauslauseke

source: All podcast artwork and content are the property of the individual podcast owners. Podcasts are not affiliated with nor endorsed by %(site_name)s. All audio files are played directly from the source.
fi: Kaikki podcast-kuvat ja -sisältö ovat yksittäisten podcast-omistajien omaisuutta. Podcastit eivät ole sidoksissa %(site_name)s:iin tai tue sitä.Kaikki äänitiedostot toistetaan suoraan lähteestä.

source: Contact Us
fi: Ota yhteyttä

source: Feedback
fi: Palauteet

source: Issues
fi: Ongelmat

source: Account Inactive
fi: Tili ei ole käytössä

source: This account is inactive.
fi: Tämä tili ei ole käytössä

source: Delete Account
fi: Poista tili

source: Please confirm that you want to delete your account. You will not be able to undo this action!
fi: Varmista, että haluat poistaa tilisi, et voi kumota tämä toiminto!

source: Are you sure?
fi: Oletko varma?

source: Yes, delete my account
fi: Kyllä, poista tilini

source: E-mail Addresses
fi: Sähköpostiosoitteet

source: The following e-mail addresses are associated with your account:
fi: Seuraavat sähköpostiosoitteet on liitetty tiliisi:

source: Primary
fi: Ensisijainen

source: Remove
fi: Poista

source: Re-Verify
fi: Vahvista

source: Warning:
fi: Varoitus:

source: Add New E-mail Address
fi: Lisää Sähköpostiosoite

source: Add E-Mail
fi: Lisää Sähköpostiosoite

source: Confirm E-mail Address
fi: Vahvista Sähköpostiosoite

source: Please confirm that <strong>%(email)s</strong> is an e-mail address for user <strong>%(user_display)s</strong>.
fi: Varmista, että <strong>%(email)s</strong> on oikea sähköpostiosoite käyttäjälle<strong>%(user_display)s</strong>.

source: Confirm E-Mail
fi: Vahvista Sähköpostiosoite

source: Hi %(username)s, greetings from %(site_name)s!
fi: Hei %(username)s, terve sivustosta %(site_name)s!

source: If you do not want to receive any more notifications, just uncheck the "Send email notifications" option on your <a style="text-decoration: underline; color: #000;" href="%(preferences_url)s">Settings</a> page.
fi: Jos et halua saada enää ilmoituksia, paina "Lähetä sähköpostiilmoituksia"painike <a style="text-decoration: underline; color: #000;" href="%(preferences_url)s">Asetukset</a>-suvulla.

source: Export
fi: Vie

source: Export your podcast feeds to an OPML file.
fi: Vie podcastisi OPML-tiedostoon.

source: Download OPML
fi: Lataa OPML

source: Import feeds from an OPML file into your collection.
fi: Tuo podcast-syötteet OPML-tiedostosta kokoelmaasi.

source: Login or Sign up with
fi: Kirjaudu tai rekisteröidy

source: Sign In
fi: Kirjaudu

source: Recover Your Password
fi: Hae salasanasi

source: Forgot Password?
fi: Unohditko salasanasi?

source: Change Password
fi: Vaihda Salasana

source: Password Reset
fi: Nollaa Salasana

source: Reset Password
fi: Nollaa Salasana

source: Your password is now changed.
fi: Salasana vaihdettu

source: Set Password
fi: Aseta Salasana

source: Preferences
fi: Asetukset

source: Save Changes
fi: Tallenna Muutokset

source: Settings
fi: Asetukset

source: Settings for %(username)s
fi: Asetukset: %(username)s

source: Import/Export Feeds
fi: Syötteiden Tuonti/Vienti

source: Statistics
fi: Tilastot

source: Email Addresses
fi: Sähköpostiosoitteet

source: Social Logins
fi: Sotetilit

source: Signup
fi: Rekisteröidy

source: Sign Up
fi: Rekisteröidy

source: Joined
fi: Rekisteröity

source: Bookmarks
fi: Kirjanmerkit

source: 1 episode
fi: 1 jakso

source: Listened
fi: Kuunneltu

source: Verify Your E-mail Address
fi: Vahvista Sähköpostiosoite

source: Add to Bookmarks
fi: Lisää Kirjanmerkkeihin

source: Remove from Bookmarks
fi: Poista Kirjanmerkkeistä

source: Bookmark
fi: Kirjanmerkki

source: Close Player
fi: Sulje Soitin

source: Close
fi: Sulje

source: Open Episode in Player
fi: Avaa Jakso Soitimella

source: Play
fi: Soita

source: You must sign up or log in to play this episode
fi: Sinun täytyy rekisteröityä tai kirjautua sisään soittaaksesi tätä jaksoa

source: Search All Podcasts
fi: Hae kaikista podcasteista

source: Newest First
fi: Uusimmat

source: Oldest First
fi: Vanhemmat

source: Search: Bookmarks
fi: Haku: Kirjanmerkit

source: Next
fi: Seuraavat

source: Previous
fi: Edelliset

source: Pagination
fi: Sivunumerointi

source: See All Episodes for %(podcast)s
fi: Katso Kaikki Jaksot Podcastissa %(podcast)s

source: Download
fi: Lataa

source: Duration
fi: Kesto

source: May contain adult themes and language. Listener discretion advised.
fi: Saattaa sisältää aikuisille suunnattuja teemoja ja kieltä. Kuuntelijan harkintavaltaa suositellaan.

source: Explicit
fi: Varoitus

source: Link
fi: Linkki

source: History
fi: Historia

source: Search: History
fi: Haku: Historia

source: Timestamp
fi: Aikaleima

source: Are you sure you want to remove this episode from your History?
fi: Haluatko varmasti poistaa tämän jaskon Historiastasi?

source: Current Time
fi: Aika

source: Time Remaining
fi: Jäljellä

source: Loading...
fi: Latautuu...

source: Error
fi: Virhe

source: Pause
fi: Paussi

source: Skip Back 10 Seconds
fi: Taaksepäin 10 Sekuntia

source: Skip Forward 10 Seconds
fi: Eteenpäin 10 Sekuntia

source: Reload Player
fi: Lataa Soitin Uudestaan

source: Decrease Playback Rate
fi: Vähennä Toistonopeus

source: Increase Playback Rate
fi: Lisää Toistonopeus

source: New Releases
fi: Uudet Jaksot

source: Promotions
fi: Ylennykset

source: Subscriptions
fi: Tilaukset

source: Find an episode...
fi: Haku: Jaksot

source: Search
fi: Haku

source: Episodes
fi: Jaksot

source: Home Page
fi: Kotisivu

source: This site uses cookies to ensure you get the best experience.
fi: Tämä sivusto käyttää evästeitä varmistaakseen, että saat parhaan käyttökokemuksen.

source: Got it!
fi: Ymmärrään!

source: No results found for <span class="font-bold">%(search)s</span>.
fi: Ei tuloksia hakusanasta <span class="font-bold">%(search)s</span>.

source: Nothing to see here.
fi: Ei tuloksia

source: Source Code
fi: Lähdekoodi

source: Report an Issue
fi: Ilmoita Ongelma

source: Podcast audio recordings, show notes and artwork are the property of the individual owners and are neither affiliated with nor endorsed by %(site_name)s.
fi: Podcast-äänitallenteet, esitysmuistiinpanot ja taideteokset ovat yksittäisten omistajien omaisuutta , eivätkä ne ole sidoksissa tai tukemaan niitä %(site_name)s:in tukemia.

source: Toggle Menu
fi: Vaihda Valikko

source: About this Site
fi: Tiedot Sivustosta

source: Page %(page_number)s
fi: Sivu %(page_number)s

source: Clear Search
fi: Poita haku

source: Share with Email
fi: Jaa Sähköpostilla

source: Share on Facebook
fi: Jaa Facebookissa

source: Share on Twitter
fi: Jaa Twitterissa

source: Share on Linkedin
fi: Jaa Linkedinissa

source: Copy link to Clipboard
fi: Kopioi linkki Leikepödälle

source: Copied link to Clipboard
fi: Linkki kopioittu Leikepödälle

source: Podcasts
fi: Podcastit

source: Categories
fi: Kategoriat

source: Logout
fi: Kirjaudu ulos

source: <a class="%(css_class)s" hx-disable="true" href="%(signup_url)s">Sign up</a> or <a class="%(css_class)s" hx-disable="true" href="%(login_url)s">log in</a> to follow your favorite podcasts and listen to episodes!
fi: <a class="%(css_class)s" hx-disable="true" href="%(signup_url)s">Kirjaudu</a> tai <a class="%(css_class)s" hx-disable="true" href="%(login_url)s">rekisteröidy</a> seurataksesi suosikkipodcastejasi ja kuunnellaksesi jaksoja!

source: Unsubscribe from this Podcast
fi: Lopeta podcastin tilaus

source: Unsubscribe
fi: Lopeta tilaus

source: Subscribe to this Podcast
fi: Tilaa Podcast

source: Subscribe
fi: Tilaa

source: Log in or sign up to subscribe to this podcast
fi: Kirjaudu tai rekisteröidy tilataksesi tämän podcastin

source: Find a category...
fi: Haku: Kategoriat

source: Search:
fi: Haku:

source: %(category_name)s Podcasts
fi: Podcastit - %(category_name)s

source: Search All Categories
fi: Etsi Kaikista Kategoreista

source: Admin
fi: Hallinto

source: Latest episode released
fi: Viimeinen jakso julkaistu

source: Similar
fi: Samanlaiset

source: Here are some podcasts you might find interesting:
fi: Tässä on joitain podcasteja, jotka saattavat olla kiinnostavia:

source: Search: Episodes
fi: Haku: Jaksot

source: Adding podcast to database...
fi: Lisätään podcastin tietokantaan...

source: Latest Episode
fi: Viimeinen Jakso

source: Search Podcasts
fi: Etsi Podcasteista

source: Search Episodes
fi: Haku: Jaksot

source: Search iTunes
fi: Etsi iTunesista

source: Search...
fi: Haku

source: You can sign in to your account using any of the following third party accounts:
fi: Voit kirjautua käyttäen seuraavia kirjautumispalveluita:

source: Add a 3rd Party Account
fi: Lisää kolmannen osapuolen tili

source: Connect to %(provider_name)s
fi: Ota yhteyttä palveluun %(provider_name)s

source: Connect
fi: Ota yhteyttä

source: I'd like to receive notications of new content and recommendations.
fi: Haluan ilmauksia uusista suosituksista

source: Select OPML file
fi: Valitse OPML-tiedosto

source: Send email notifications
fi: Lähetä ilmauksia sähköpostilla

source: Language
fi: Kieli

source: Your preferences have been saved
fi: Asetuksesi tallennettu

source: %(count)d podcast feed added to your collection
fi: %(count)d podcast lisätty kokoelmaasi

source: No new podcasts found in uploaded file
fi: Ei uusia podcasteja löydetty tiedostosta

source: Your account has been deleted
fi: Tilisi on poistettu
